// Задача 42: Определить, сколько чисел больше 0 введено с клавиатуры.
Console.WriteLine("Hello, World!");
